using System;
using System.Drawing;
using System.Windows.Forms;
using SortAlgoGuide.MyUserControl.TheoryPattern;
namespace SortAlgoGuide
{
    internal class OnClick_Theory
    {
       
        public static UserControl[] GetText(string Algo)
        {
            switch (Algo)
            {
                case "General":
                    return Text_GeneralInfo_Click();                    
                case "bubble":
                    return Text_bubble_Click();                    
                case "random":
                    return Text_Random_Click();                    
                case "quick":
                    return Text_Quick_Click();                    
                case "shell":
                    return Text_Shell_Click();                    
                case "comb":
                    return Text_Comb_Click();                    
                case "radix":
                    return Text_Radix_Click();                    
                case "shaker":
                    return Text_Shaker_Click();                    
                case "insertion":
                    return Text_Inserion_Click();                    
                case "select":
                    return Text_Select_Click();                    
                case "time_compl":
                    return time_compl_Text_Click();                    
                case "count":
                    return Text_Count_Click();                    
                case "merge":
                    return Text_Merge_Click();                    
            }
            return null;
        } // створює слайди з теорією для певного алгоритму та повертає у вигляді масиву UserControl[]
        private static UserControl[] Text_GeneralInfo_Click()
        {
            
           UserControl first, second, third;
            first = new Img_Text("Алгоритм сортування використовується для перевпорядкування заданого масиву " +
             "або списку елементів відповідно до оператора порівняння елементів. Оператор порівняння використовується " +
             "для визначення нового порядку елементів у відповідній структурі даних. ", Properties.Resources.sorting_algorithms_mini_1);
            second = new OnlyText("На практиці елементи, що впорядковуються, рідко бувають просто числами. " +
             "Набагато частіше, кожен такий елемент є записом (англ. record). В кожному записі є ключ (англ. key), " +
             "по якому власне і здійснюється впорядкування, в той же час є й інша супутня інформація. " +
             "Сам метод сортування не залежить від того, чи впорядковуються тільки числа, чи також і супутня інформація, " +
             "тому при описі алгоритмів для простоти припускають, що елементи є числами. ");
            third = new OnlyText("Для алгоритму сортування (як і для будь-якого іншого сучасного алгоритму) основними характеристиками є: " +
             "1) Час, необхідний на впорядкування n - елементного масиву.\r\nДля значної кількості алгоритмів середній і " +
             "найгірший час впорядкування є O(n^2) — це пов'язано з тим, що в них передбачені " +
             "перестановки елементів, що стоять поряд (різниця між індексами елементів не перевищує деякого заданого числа). " +
             "Такі алгоритми зазвичай є стабільними, хоча і не ефективними для великих масивів. Інший клас алгоритмів здійснює " +
             "впорядкування за час O ( n log n ) . В цих алгоритмах використовується можливість обміну елементів, що знаходяться " +
             "на будь-якій відстані один від одного.\r\n" +
             "2)Необхідність додаткової пам'яті для сортування.\r\n" +
             "3)Стабільність(англ.Stability). " +
             "Стабільним (або стійким) називається такий алгоритм сортування, що не змінює порядок елементів з однаковим ключем. ");
            return new UserControl[] { first, second, third };
        }

        private static UserControl[] Text_bubble_Click()
        {
            
            UserControl first, second;
            first = new OnlyText("Бульбашкове сортування — це найпростіший алгоритм сортування," +
                " який працює шляхом повторної заміни суміжних елементів, якщо вони розташовані " +
                "в неправильному порядку. Цей алгоритм не підходить для великих наборів даних, " +
                "оскільки його середня та найгірша часова складність досить висока.");
            second = new Img_Text("Як бачимо, порівнюються по 2 елементі с початку масиву. " +
                "В залежності від потрібного порядку сортування числа переставляються. Якщо" +
                " потрібна послідновінсть у порядку зростання (як на прикладі вище), то відповідно," +
                " більше число ставиться ближче к кінцю, а менша к початку масиву. Якщо навпаки, послідновінсть " +
                "у порядку спадання, то більше число ближче до початку, менша - до кінця.", Properties.Resources.Bubble);
            return new UserControl[] { first, second};
        }

        private static UserControl[] Text_Random_Click()
        {
           
            UserControl first, second, third;
            first = new Img_Text("«Алгоритм Випадкового сортування»\r\n Алгоритм Bogo заснований на парадигмі генерування та тестування. " +
             "Він послідовно генерує перестановки своїх вхідних даних (масив невідсортованих даних), " +
             "доки не знайде той, який відсортовано. Наприклад, якщо bogosort використовується для сортування " +
             "колоди карт, він буде складатися з перевірки, чи була колода впорядкована чи ні. Якщо ні то " +
             "підкине колоду в повітря, візьме карти навмання й повторить процес перевірки. І так, доки колода не " +
             "буде відсортована. Не будемо зупинятись на алгоритмі, бо розглядати нічого тут - звичайна випадкова " +
             "генерація послідовності даних поки не вийде відсортована послідовність. ", Properties.Resources.Bogo);
            second = new OnlyText("Bogo Sort має багато інших назв, наприклад сортування перестановкою (permutation sort), " +
             "повільним сортуванням (slow sort), сортування дробовиком (shotgun sort), тупе сортування " +
             "(stupid sort), мавпяче сортування, сортування випадковим чином або сортування п’яних чоловіків. ");
            third = new Img_Text("Чому його так називають? \r\n Відповідь - Часова складність сортування Bogo становить O(∞), " +
             "оскільки цей алгоритм не має верхньої межі. Отже, можете собі уявити, наскільки неефективним є цей " +
             "алгоритм сортування. Ось чому за його надзвичайну неефективність його жартома називають " +
             "такими образливими назвами. ", Properties.Resources.Bogo_m);
            return new UserControl[] { first, second, third };
        }

        private static UserControl[] Text_Quick_Click()
        {
            
            UserControl first, second, exempl_0,
                exempl_1,
                exempl_2,
                exempl_3,
                exempl_4,
                exempl_5,
                exempl_6,
                exempl_7,
                exempl_8,
                exempl_9,
                exempl_10;
            first = new OnlyText("Загальна ідея алгоритму «Швидкого сортування» (далі Quicksort) полягає в наступному:\r\n " +
             "- Вибрати з масиву опорний елемент. Це може бути будь - який з елементів масиву. " +
             "Від вибору опорного елемента залежить коректність алгоритму, та ,у окремих випадках, може сильно " +
             "залежати і його ефективність.\r\n " +
             "- Порівняти всі інші елементи з опорним переставляючи їх у масиві так, щоб розбити масив на три безперервних " +
             "відрізки, що йдуть один за одним: «елементи менші за опорні», «рівні» і «більші» (напрактиці беруть 2 відрізка: " +
             "«елементи менші і рівні» та «більші» або навпаки).\r\n " +
             "-Для відрізків «менших» і «більших» значень виконати рекурсивно ту ж послідовність операцій, " +
             "якщо довжина відрізка більше одиниці.\r\n " +
              "Є декілька варіацій цього алгоритму, суть яких одна і та ж: вибрати опорний елемент та відносно " +
              "нього робити сортування. ");
            second = new OnlyText("Один з варіантів обрати останній елемент опорним, та тримати покажчик на ньому " +
             "та покажчик на початку масиву («обраний» -> Chosen = arr.Length - 1, другий покажчик –> pointer = 0). " +
             "При ітерації, якщо обраний елемент більший за елемент на індексі ітерації (arr[Chosen] > arr[i]), " +
             "переставляємо елементи в покажчиках  [pointer] та [і], після чого збільшуючи pointer на 1. " +
             "Коли ітерація закінчилась, переставляємо елементи [pointer] та [Chosen]. Так в нас вийде послідовність, " +
             "де елементи менше обраного стоять лівіше нього, а ті що більше чи рівні йому правіше. Повторюємо операцію " +
             "рекурсивно на ліву та праву частини масива відносно обраного елемента. ");
            exempl_0 = new Img_Text("Для кращого розуміння розберемо на прикладі цей алгоритм використовуючи масив, що зображено на " +
             "малюнку, де є раніше згадані покажчики та ітератор 'і' ", Properties.Resources.quick_0);
            exempl_1 = new Img_Text("Перший же елемент виявився менший за обраний, тому вібувається пуста перестановка " +
             "(тобто той же елемент переставляється на те ж місце). Программа йде по коду, вона не може зрозуміти як людина, що це той самий " +
             "елемент, тільки якщо в коді буде прописано 'нічого не робити' при такій ситуації. ", Properties.Resources.quick_1);
            exempl_2 = new Img_Text("pointer збільшився на 1, а ітератор йде далі, порівнюючи кожен елемент з обраним. " +
             "Пропустивши всі елементи, що не задовільняють нашій умові, ітератор дійшов до -5, що менше за обраний елемент, " +
             "тому відбувається перестановка значення на ітераторі та pointer, при цьому pointer збільшується потім на 1 ", Properties.Resources.quick_2);
            exempl_3 = new Img_Text("Після попередньої перестановки жодного елемента, що підходив би умові не має, " +
             "тому ітератор проходить до кінця, де за алгоритмом, переставляються місцями обраний елемент з pointer ", Properties.Resources.quick_3);
            exempl_4 = new Img_Text("Тепер наш масив розділено на 2 частини - ліва частина, де елементи менше обраного, права - " +
             "більше-дорівнюють. Рекурсивно запускаємо той же алгоримт вказуючи ці частинки для алгоритму як окремі масиви " +
             "(границі для лівої частини = від 0 до Chosen, для правої - від Chosen до arr.Length) ", Properties.Resources.quick_4);
            exempl_5 = new Img_Text("В лівій частині всього 2 елементи, тому спочатку відбувається пуста перестановка, а потім " +
             "Chosen міняються з pointer ", Properties.Resources.quick_5);
            exempl_6 = new Img_Text("", Properties.Resources.quick_6);
            exempl_7 = new Img_Text("Далі все по алгоритму, як в попередніх малюнках ", Properties.Resources.quick_7);
            exempl_8 = new Img_Text("", Properties.Resources.quick_8);
            exempl_9 = new Img_Text("", Properties.Resources.quick_9);
            exempl_10 = new Img_Text("Наша остання перестановка буде на підмасиві [5,6], де 2 елементи поміняються містами і на цьому " +
             "масив буде відсортований ", Properties.Resources.quick_10);
            return new UserControl[] { first, second, exempl_0,
                exempl_1,
                exempl_2,
                exempl_3,
                exempl_4,
                exempl_5,
                exempl_6,
                exempl_7,
                exempl_8,
                exempl_9,
                exempl_10 };

        }

        private static UserControl[] Text_Shell_Click()
        {
           
            UserControl first, second, exempl_0, exempl_1;
            first = new OnlyText("«Сортування Шелла» деякий підвид сортування вставками в комбінації " +
             "з сортуванням гребінцем. Ідея закладається в тому, щоб робити сортування вставками " +
             "не суміжні числа по порядку, а числа на деякій відстані (як в сортуванні гребінцем), " +
             "потім просто зменшувати цю відстань по певному правилу (наприклад якщо відстані була " +
             "обрана з формулою [відстань = Довжина масива/деякий коефіцієнт], то після першої ітерації, " +
             "ділимо попереднє значення відстані на цей же коефіцієнт). Але різниця від гребінця в тому, " +
             "що при проході деякої послідовності чисел з кроком у цю дистанцію всі числа цієї послідовності " +
             "100% будуть відсортовані, коли у гребінця на це не  звертається уваги, бо в кінці всі числа " +
             "встануть на місця використанням простого бульбашкового сортування. ");
            second = new OnlyText("Дуже важливим є вибір відстані для сортування Шелла. " +
             "Э багато варіацій, найпростіша з яких просто взяти за початкову відстані " +
             "довжину масиву/2, але тоді часова ефективність буде = O(N^2) в найгіршому випадку. " +
             "Є ще послідовність Хіббарда = 2і - 1, асимптота в гіршому випадку - O(n^1,5), послідовність " +
             "Седжвіка (формула досить незвична, тому, якщо цікаво можете подивитись в інтернеті, бо метою " +
             "на зараз є просто розгляд даного алгоритму сортування, а не досконале вивчення) - O(n^4/3), Пратта " +
             "(всі добутки степенів двійки та трійки) - O(n(log n)2) та інші. ");
            exempl_0 = new Img_Text("Візьмемо за приклад масив, що зображено на малюнку. Нам важливо побачити різницю. " +
             "Не будемо повністю розглядати сортування, бо суть алгоритму схожа з алгоритмом гребінцем. Є тільки 1 нюанс, який зараз і розглянемо. ", Properties.Resources.shell_0);
            exempl_1 = new Img_Text("Нехай коефіцієнт = 3. Тоді помітимо червоним кольором групу елементів, яка буде " +
             "сортуватися при початковому індексі ітератора 0 (хоч і ітерація звичайна інкрементна (і++), але при перестановках " +
             "участь беруть елементи з індексом кратним коефіцієнту). Як бачимо при 6 ітерації 6>-5 (arr[i]>arr[i+k]) тому їх переставляємо, але на " +
             "цьому не закінчуємо (як в Comb Sort), зменшуємо `і` на наш коефіцієн тим самим йдучи назад, та порівнюємо нашу переставлену -5 " +
             "з попереднім елементом: 1>-5 ->переставляємо їх. Знову i=i-k, -3>-5 -> переставляємо. В кінці в нас вийшло, що ітератор повернувся " +
             "на початок, а -5 з самого кінця встала на самий початко де їй місце і в нас вийшла відсортована послідовність " +
             "індексів кратним 3 починаючи з 0 {-5, -3, 1, 6}. ", Properties.Resources.shell_1);

            return new UserControl[] { first, second, exempl_0, exempl_1 };
        }

        private static UserControl[] Text_Comb_Click()
        {
            
            UserControl main,first, exempl_0, exempl_1, exempl_2, exempl_3, exempl_4, exempl_5;
            main = new Img_Text("«Сортування гребінцем» (Comb Sort) -  вдосконалення бульбашкового сортування. ", Properties.Resources.comb);
            first = new OnlyText("Бульбашкове сортування завжди порівнює суміжні значення. " +
             "Таким чином, усі перестановки відбуваються одна за одною. " +
             "Для того, щоб позбутися «черепах» (елементів місце яких на початку, але вони знаходяться в самому кінці, " +
             "тому проходить величезна кількість циклів поки елемент «доповзе» до початку), " +
             "переставлятимемо елементи, що стоять на відстані. " +
             "Розрив починається з великого значення (зазвичай з довжини самого масиву) та зменшується в 1.247 " +
             "(інколи беруть близькі значення, наприклад 1.2 або 1.3) рази на кожній ітерації, " +
             "доки не досягне значення 1. " +
             "Таким чином, гребінчасте сортування усуває черепах та дозволяє бульбашковому алгоритму " +
             "за декілька циклів отримати відсортовану послідовність. ");
            exempl_0 = new Img_Text("За приклад слугуватиме масив довжиноюв 6 елементів ", Properties.Resources.comb_0);
            exempl_1 = new Img_Text("Порівнюємо елементи на відстані рівній розміру масиву - 1. Елементи задовільняють умові " +
             "тому переставляємо їх. Відразу можна побачити, що як раз та «черепаха» у вигляді -3 відразу опинилась " +
             "на початку ", Properties.Resources.comb_1);
            exempl_2 = new Img_Text("Зменшуємо коефіцієнт у 1.3 рази і отримаємо 4. Порівнюючи елементи нічого не переставляємо бо, " +
             "не одна пара з елементів на даній відстані не задовільняють умові ", Properties.Resources.comb_2);
            exempl_3 = new OnlyText("Така ж історія і з наступним коєфіцієнтом 3 ");
            exempl_4 = new Img_Text("А ось с коефіцієнтом 2 відбулось вже 2 перестановки пар -3 та -5 і 2 та 1. ", Properties.Resources.comb_4);
            exempl_5 = new Img_Text("Коефіцієнт дійшов до 1 тому відбулось бульбашкове сортування " +
             "і всі елементи встали на свої місця. ", Properties.Resources.comb_5);
            return new UserControl[] {main, first, exempl_0, exempl_1, exempl_2, exempl_3, exempl_4, exempl_5 };
        }

        private static UserControl[] Text_Radix_Click()
        {
            
            UserControl first, second, exempl_0, exempl_1, exempl_2, exempl_3, exempl_4, exempl_5, exempl_6, exempl_7;
            first = new Img_Text("«Порозрядне сортування» - сортування чисел щодо їх розрядів. Існують 2 вида сортування " +
             "LSD (least significant digit) / MSD(most significant digit) (LSD(молодша значуща цифра) " +
             "/ MSD(старша значуща цифра)). ", Properties.Resources.main1);
            second = new OnlyText("Якщо LSD, то сортування починають із найменшого розряду і по ньому сортують " +
             "числа по принципу алгортму сортування підрахунком, потім розряд вищий і знову перестановка " +
             "(сортування), і так до найвищого розряду. MSD теж саме, але починається сортування із найбільшого розряду. " +
             "Порівнянь ніяких не проводитися, просто йде перестановка вперед чисел, у яких більше значення розряду. " +
             "Ми розглянемо LSD версію. ");
            exempl_0 = new Img_Text("Розглянемо масив невідсортованих значень зображених на малюнку " +
             "як приклад. ", Properties.Resources.radix_0);
            exempl_1 = new Img_Text("Створимо для зручності буферний масив, куди будемо записувати розряд " +
             "елементу з основного масиву. ", Properties.Resources.radix_1);
            exempl_2 = new Img_Text("Після чого створимо двійний список (не масив, бо ми не знаємо точно скільки яких чисел буде) " +
             "розміром в 19 елементів (кількість чисел від -9 до 9). В цей масив будемо записувати скільки чисел нам зустрілось " +
             "з розрядами (грубо кажучи будемо просто рахувати, але це не точне визначення, бо ми відразу ж будемо знати куди " +
             "і що записувати за допомогою буферного масиву). ", Properties.Resources.radix_2);
            exempl_3 = new Img_Text("Додаємо до списку Count наші елементи по принципу " +
             "Count[min + arr[i]].Add(arrForSort[i]), де min це мінімальний розряд взятого за модулем " +
             "(тобто без знака '-'). Так ми вказуємо що нам треба записати число в список на позицію, що рівна розряду в " +
             "буферному arr зі зсувом min. ", Properties.Resources.radix_3);
            UserControl explain = new OnlyText("Пояснення щодо зсуву в min: наш список як і масив в коді рахується від 0, і відповідно " +
             "в нього неможна записати значення за розрядом менше 0, тому ми зсуваємо (умовно) індекс 0 на позицію рівну від'ємному " +
             "розряду і, коли ми рахуємо розярди, в нас виходить масив з індексами не {0, 1, 2, 3...9},a {-9,-8,-7...0...9}, " +
             "що спрощує задачу запису від'ємних розрядів. Наприклад якщо треба записати число з розрядом -5, то воно запишеться в комірку " +
             "під індексом не -5 а [min+arr[i]] (якщо min було (-)8), то в нас буде комірка [8+(-5)]-> 3, бо {0,1,2,3,4,5} рахує програма, а ми " +
             "рахуємо {-8,-7,-6,-5} (без -9, бо в нас такого розряду не було. -8 наша границя) ");
            exempl_4 = new Img_Text("Перезаписуємо нашу послідовність в оригінальний масив " +
             "з нашого списку від 0 до останнього елемента послідовно. Вже можна побачити як від'ємні числа зайняли своє місце. ", Properties.Resources.radix_4);
            exempl_5 = new Img_Text("На цьому алгоритм закінчується. Все що залишається робити одне і те ж поки не досягнемо " +
             "максимального розряду. В нас максимальний розряд 3, тому операція повторюється ще 2 рази: з 2 розрядом та з 3. " +
             "Для чисел які не мають розряду вище просто присвоюється розряд 0. ", Properties.Resources.radix_5);
            exempl_6 = new Img_Text("Проводимо операцію з 3 розрядом ", Properties.Resources.radix_6);
            exempl_7 = new Img_Text("Перезаписуючи елементи бачимо, що всі вони стоять на своїх місцях. Послідовність відсортована. ", Properties.Resources.radix_7);

            return new UserControl[] 
            { first, second, exempl_0, exempl_1, exempl_2, exempl_3,explain, exempl_4, exempl_5, exempl_6, exempl_7 };
        }

        private static UserControl[] Text_Shaker_Click()
        {
            
            UserControl first, second;
            first = new OnlyText("«Шейкерне сортування» (Shaker Sort) \r\n" +
             "Також відоме як сортування перемішуванням і коктейльне сортування. " +
             "Зауважимо, що бульбашкове сортування працює повільно на тестах, " +
             "у яких маленькі елементи стоять наприкінці (їх ще називають «черепахами»). " +
             "Такий елемент на кожному кроці алгоритму буде переміщуватись лише на одну позицію вліво. " +
             "Тому йтимемо не лише зліва направо, а й справа наліво виконуючи те саме бульбашкове сортування. ");
            second = new OnlyText("Принцип такий: підтримуватимемо два покажчики begin і end, що позначають, " +
             "який відрізок масиву ще не відсортований. На черговій ітерації при досягненні end віднімаємо з нього одиницю " +
             "і рухаємося справа наліво, аналогічно, при досягненні begin додаємо одиницю і рухаємося зліва направо і це все в одному циклі." +
             "Ще варіант зробити це в 2 різних циклах. Так, коду більше, але він буде зрозуміліше ніш все в одній купі.\r\n" +
             "Асимптота у алгоритму така ж, як і у сортування бульбашкою, проте реальний час роботи кращий. " +
             "Розглядання прикладу є зайвим, бо це те ж саме бульбашкове сортування тільки в 2 сторони. ");
            return new UserControl[] { first, second };
        }

        private static UserControl[] Text_Inserion_Click()
        {
            
            UserControl first, exempl;
            first = new Img_Text("«Сортування вставками» – це простий алгоритм сортування, " +
             "який працює подібно до того, як ви сортуєте гральні карти у своїх руках. " +
             "Масив практично розбитий на відсортовану та невідсортовану частини. Значення з " +
             "невідсортованої частини вибираються та розміщуються в правильному місці в відсортованій " +
             "частині. ", Properties.Resources.main);
            exempl = new Img_Text("Принцип сортування дуже простий, його можна зрозуміти подивившись на приклад на малюнку. ", Properties.Resources.ins_0);
            return new UserControl[] { first, exempl };
        }

        private static UserControl[] Text_Select_Click()
        {
            
            UserControl first, exempl_0, exempl_1, exempl_2;
            first = new OnlyText("Алгоритм «Вибіркове сортування» сортує масив шляхом повторного знаходження " +
             "мінімального елемента з невідсортованої частини та розміщення його на початку. \r\n" +
             "Алгоритм підтримує два підмасиви в заданому масиві:\r\n" +
             "  - Підмасив, який уже відсортовано.\r\n" +
             "  - Залишок підмасиву, що не відсортовано.\r\n" +
             "У кожній ітерації сортування мінімальний елемент (у порядку зростання) з невідсортованого " +
             "підмасиву вибирається та переміщується до відсортованого підмасиву. Є ще варіант з використанням максимального " +
             "елемента масиву. Ті самі дії, просто елементи переміщуються у кінець. ");
            exempl_0 = new Img_Text("Розгляномо на прикладі масиву зображеного на малюнку. ", Properties.Resources.select_0);
            exempl_1 = new Img_Text("Будемо підтримувати покажчик (pointer), що відповідає за розділення масиву " +
             "на відсортовану та невідсортовану частину. Так як відсортованої частини масива ще нема, покажчик = 0. " +
             "Знаходимо найменший елемент - це -5. Міняємо місцями цей елемент з елементом на якому стоїть покажчик (індекс 0). " +
             "Тепер в нас з'явилась відсортована частина масиву. Покажчик при цьому збільшуємо, відповідно, на 1. Повторюємо попередні дії. ", Properties.Resources.select_1);
            exempl_2 = new Img_Text("Алгоритм повторюється до моменту поки покажчик не буде дорівнювати індексу останнього елементу масиву, " +
             "або просто довжині масиву - 1 (одне і те ж). Це означатиме, що масив відсортований. " +
             "Можна замітити, що коли мінімальний елемент вже сам по собі знаходиться " +
             "в потрібному місці відбувається пуста перестановка (елемент сам себе заміщує). Для того, щоб такого не було, треба просто додати до функції " +
             "перестановки додаткову умову, але зауважте, що тепер кожен раз при будь-якій перестановці процесор буде витрачати час на порівняння " +
             "елементів. На роботі це не сказиться, якщо розмір масиву малий, але якщо елементів більше, наприклад, 10 000. Уявляєте скільки це " +
             "непотрібних операцій порівяння. ", Properties.Resources.select_2);
            return new UserControl[] { first, exempl_0, exempl_1, exempl_2 };
        }

        private static UserControl[] time_compl_Text_Click()
        {
            
            UserControl first, second;
            first = new OnlyText("Часова складність алгоритму в комп'ютерних науках є обчислювальною " +
                "складністю алгоритму, яка описує час потрібний для виконання алгоритму. Вона зазвичай " +
                "визначається шляхом підрахунку кількості елементарних операцій, виконуваних алгоритмом, " +
                "при цьому вважають, що кожна елементарна операція виконується за фіксовану кількість часу. " +
                "Таким чином, кількість часу і кількість елементарних операцій, необхідних для виконання алгоритму, " +
                "відрізняються постійним множником. ");
            second = new Img_Text("На малюнку вище приведено часову складність для всіх описаних в цій програмі " +
                "алгоритмів. (Дод. інформація: в с. Шелла прочерк бо все залежить від вибору коефіцієнта; " +
                "в Випадковому с. прочерк - кращої складності немає, АЛЕ завжди є шанс, що випаде відсортовано послідовність з 1 разу; " +
                "в Розрядному с. n - кількість ключів (елементів), а w - довжина ключа; " +
                "в с. Підрахунком k - діапазон наших чисел (від найменшого до найбільшого)). \r\n" +
                "Треба зауважити, що не для всіх алгоритмів існує одна часова кладність, а саме:\r\n" +
                " - Для сортування Шелла вказана складність при діленні відстані на 2, але існують інші варіації вибору коефіцієнта, що" +
                "покращує/погіршує часову складність,  також в залежності і від масива чисел.\r\n" +
                " - Для швидкого с. існуєть дві часові складності в кращому випадку: O(nlog(n)) (коли ділимо масив на 2 частини)" +
                "та O(n) (ділимо на 3 частини)\r\n" +
                " - Часова складність сортування гребінцем залежить від вибраної послідовності. В таблиці наведена часова складність" +
                "послідовностей, що в середньоу 'Найкращі', 'середні', 'найгірші'.\r\n", Properties.Resources.TimeComplxty);
            return new UserControl[] { first, second };
        }

        private static UserControl[] Text_Count_Click()
        {            
            UserControl first, exempl_0, exempl_1, exempl_2, exempl_3, exempl_4;
            first = new OnlyText("«Сортування підрахунком» (Counting sort) \r\n" +
             "Створюється масив у довжину, що дорівнює максимальному числу в невідсортованому масиві. " +
             "Іде підрахунок зустрічі кожного числа. Потім просто в масив, відносно масиву підрахованих величин, " +
             "вставляються числа(індекс в масиві підрахунку це і є наше число яке ми встановлюємо Х разів, яке " +
             "дорівнює числу під індексом) по порядку зростання / спадання, створюючи відсортований масив. На словах " +
             "може звучати складно, але на прикладі все просто. ");
            exempl_0 = new Img_Text("Для початку створемо масив довжиною в суму найменшого (якщо число від'ємне) та найбільшого нашого елемента по " +
             "модулю додавши до суми 1. Така формула зумовлена тим, що ми умовно розділяємо наш масив на елементи менше 0 та більше, якщо в нас " +
             "немає від'ємних елементів, то min залишимо 0 ", Properties.Resources.count_0);
            exempl_1 = new Img_Text("Після попередньої операції підраховуємо скільки який елемент нам зустрівся в оригінальному масиві. Це ми робимо звичайним " +
             "циклом. Підрахунок відбувається по формулі (Нехай новий масив зветься Count[]) " +
             "Count[arr[i]-min] = Count[arr[i]-min] + 1. Відповідно коли в нас буде число -5 при мінімальному числі -5, " +
             "то ми зробимо +1 (тобто підрахуємо те, що в нас є Х+1 такий елемент) на позицію 0 масиву (умовно -5 для нас). ", Properties.Resources.count_1);
            exempl_2 = new Img_Text("Після того, як пройшлись по всьому оригінальному масиву і підрахували всі наші числа, " +
             "починаємо перезаписувати наш оригінальний масив у відсортовану послідовність зменшуючи при цьому кількість елементів, " +
             "що ми рахували в нашому count[] тим самим впевняючись, що всі елементи повернуті в оригінальний масивю ", Properties.Resources.count_2);
            exempl_3 = new Img_Text("", Properties.Resources.count_3);
            exempl_4 = new Img_Text("Таким чином ми отримали відсортовану послідовністью ", Properties.Resources.count_4);
            return new UserControl[] { first, exempl_0, exempl_1, exempl_2, exempl_3, exempl_4 };
        }

        private static UserControl[] Text_Merge_Click()
        {            
            UserControl first, exempl_0, exempl_1;
            first = new OnlyText("«Сортування розділенням»\r\nДля цього алгоритму дуже підходить відома фраза " +
             "«Розділяй та владарюй», бо по такому принципу він і працює.\r\n" +
             "Для вирішення задачі сортування, розділимо її на три етапи:\r\n" +
             "  - Невідсортований масив рекурсивно розбиваємо на дві частини приблизно однакового розміру, " +
             "до моменту коли розмір підмасивів не досягне одиниці(будь-який масив довжини 1 можна вважати впорядкованим));\r\n" +
             "  - Створюємо відсортовані частини масиву шляхом злиття двох вже попередньо відсортованих " +
             "масива(процедура злиття: ми беремо менший з двох перших елементів підмасивів і записуємо його в результуючий масив);\r\n" +
             "  - Повторюємо попередній пункт поки не отримаємо вже відсортований масив; ");
            exempl_0 = new Img_Text("Нічого складного, ділимо масив поки не отримаємо послідовність з одновимірних масивів. " +
             "Як з варіантів реалізації можно обрати метод, що отримує масив у вигляді 2 його частин і рекурсивно ділить підчастини " +
             "на такіж самі підчастини меншого розміру до моменту, коли довжина масиву буде дорівнювати 1, тоді він з'єднує 2 отриманих елементи " +
             "(по 1 елементу на масив) в 1 відсортований масив і повертає його, виходячи з рекурсії. Отримавши відсортовану частину знову відбувається об'єднання і вихід з рекурсії. " +
             "Ще варінт розбити просто масив на підмасиви і зробити масив масивів (або списокк списків), де потім можна працювати з ними. ", Properties.Resources.merge_0);
            exempl_1 = new Img_Text("Ну і відповідно процес злиття, що приводить до отримання відсортованої послідовності. Найчастіше використовують рекурсію. ", Properties.Resources.merge_1);
            return new UserControl[] { first, exempl_0, exempl_1 };
        }
    }
}
